{"basics":{"name":"Harsh Vora","label":"MEM Graduate Student","image":"","email":"harsh.vora@duke.edu","phone":"","url":"","summary":"","location":{"address":"","postalCode":"","city":"Durham","countryCode":"USA","region":"North Carolina"},"profiles":[{"network":"Twitter","username":"AlbertEinstein","url":"https://twitter.com/AlbertEinstein"}]},"work":[{"name":"Deloitte (India - Offices of the US)","position":"Business Technology Analyst","url":"","startDate":"July 2021","endDate":"April 2023","summary":"","highlights":["Accelerated invoice and inventory management efficiency by 32% using agile methodologies-led design of 7 cross-platform applications, enhancing delivery speed to customers and overall system scalability , Achieved an 80% reduction in critical software defects during System Integration Testing phase by proactively identifying root causes and strategizing targeted defect resolution sprints using Jira, Transformed user experience metrics like Net Promoter Score and Customer Effort Score and boosted positive user reviews by 20% by enabling business teams with intuitive, no-code tools to rapidly iterate on customer-facing interfaces, Led cross-functional teams of engineers, product managers, and designers to manage full product lifecycles, ensuring consistent alignment with target market demands and overall company growth strategy."]},{"name":"MyCaptain","position":"Product Marketing Intern","url":"","startDate":"June 2020","endDate":"Aug 2020","summary":"","highlights":["Catalyzed a 28% surge in sales and a 25% increase in revenue by engineering a dynamic marketing strategy using Python and ML for targeted, personalized ads, Reinforced brand loyalty and achieved a 21% increase in key performance indicators (KPIs) like customer retention by analyzing user feedback and market trends to propose and implement innovative customer loyalty programs, Enhanced user engagement, driving 30% in subscriptions by implementing gamification informed by customer feedback analysis."]},{"name":"Kalki Communication Technologies Pvt. Ltd","position":"Product Management Intern","url":"","startDate":"June 2019","endDate":"Aug 2019","summary":"","highlights":["Created an innovative forecast dashboard for Power Generation firms, optimizing electricity distribution and redirecting surplus to achieve an 18% improvement in operational efficiency, resulting in a significant reduction of carbon footprint, Executed the integration of renewable energy forecasting models into the dashboard, facilitating a 20% increase in the utilization of green energy sources leading to reduced reliance on non-renewable resources, Boosted customer retention rate by 22% after interviewing plant managers to prioritize data -driven dashboard enhancements."]},{"name":"LastRocketHome","position":"Product Management Student Consultant","url":"","startDate":"August 2023","endDate":"November 2023","summary":"","highlights":["Led the firm’s transformation from consulting to SaaS model, developing a roadmap to enter the $850M predictive analytics space, Crafted 4 detailed user personas and compelling user stories through a design thinking approach, addressing consumer pain points identified by conducting over 60 stakeholder interviews, Forged a pivotal go-to-market (GTM) and product enhancement strategy with the CEO, targeting heightened client satisfaction."]},{"name":"CycLoan","position":"Student Product Manager","url":"https://example.com","startDate":"June 2019","endDate":"November 2019","summary":"","highlights":["• Conducted market analysis for a bike lending service, developing a route-to-market (RTM) strategy that cut initial costs by 20%, increased campus coverage to 90%, and grew the user base by 40%, Performed break-even analysis of MVP, achieving a break-even point of 80 rentals a day and a 65% profit rate."]}],"volunteer":[{"organization":"International Society of Automation (ISA-VIT)","position":"Marketing Head","url":"https://example.com","startDate":"2014-04-01","endDate":"2015-07-01","summary":"","highlights":["Orchestrated the planning and execution of dynamic marketing campaigns, boosting workshop and hackathon participation by 40% and attracting students from diverse universities across the country, Executed the SPARK annual technical festival, attracting 500+ attendees, securing key sponsorships, and featuring distinguished speakers from NASA, ISA Global, and industry leaders in IoT and AI."]}],"education":[{"institution":"Duke University","location":"Durham, NC, USA","url":"https://duke.edu/","area":"Master of Engineering Management with specialization in Product Management","studyType":"Masters","startDate":"August 2023","endDate":"December 2024","score":"3.9/4.0","courses":["Design Thinking, Marketing, Finance, Competitive Strategies, Management in High Tech Companies"]},{"institution":"VIT University","location":"Vellore, India","url":"https://vit.ac.in/","area":"Bachelor of Technology in Computer Science Engineering","studyType":"Bachelors","startDate":"July 2017","endDate":"June 2021","score":"3.7/4.0","courses":["Lean Startup Management, Business Management, Cybersecurity, Database Management Systems"]}],"skills":[{"name":"Business","level":"Master","icon":"fa-solid fa-hashtag","keywords":["Project Management","Agile methodologies","Scrum","Market research","Roadmapping","Competitive analysis","User experience (UX)","A/B testing","Wireframing","API integration","Cross-functional collaboration","Data visualization","Data analytics","Documentation","User research","CRM","Product design","Troubleshooting","Product portfolio","Strategic marketing","Market segmentation"]},{"name":"Technical","level":"Master","icon":"fa-solid fa-hashtag","keywords":["JIRA","Power BI","SAP","Tableau","Java","JavaScript","No-code/low-code","Web development","App development","SQL","HTML","CSS","ReactJS","XML","MySQL","Git","AWS","Azure","UI/UX","Cybersecurity","AI/ML","Python","R","MATLAB","Figma","Flutter","User interface UI/UX","Excel"]}]}